"""
Создайте несколько переменных разных типов.
Проверьте к какому типу относятся созданные переменные.
"""


a = 5
print(type(a))
b = "hello world"
print(type(b))
c= 42.0 * 3.141592 / 2.71828
print(type(c))
